doc/Transience-instructions.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Transience - interactive score</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-11-07 22:24:42 EST"/>
<meta name="author" content="Michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://matralab.hexagram.ca/includes/style.css" />
</head>
<body>
<div id="content">

<h1 class="title">Transience - interactive score</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Intro </a></li>
<li><a href="#sec-2">2 Installing in Mac OS </a></li>
<li><a href="#sec-3">3 Operation </a></li>
<li><a href="#sec-4">4 Saving score pages </a>
<ul>
<li><a href="#sec-4_1">4.1 The changes from the original, paper version </a></li>
<li><a href="#sec-4_2">4.2 Score configuration </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Installing on Linux: </a></li>
<li><a href="#sec-6">6 Outro </a>
<ul>
<li><a href="#sec-6_1">6.1 To do </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Intro </h3>
<div class="outline-text-3" id="text-1">


<p>
This is a short set of instructions on how to run the interactive score software for Transience by Sandeep Bhagwati.
The software actually consists of 2 different applications: 
</p>
<ul>
<li>
Transience: developed at Matralab by myself (Michal Seta).
</li>
<li>
INScore: developed by Grame and Dominique Fober: <a href="http://inscore.sourceforge.net/">http://inscore.sourceforge.net/</a>

</li>
</ul>

<p>INScore is a stand-alone application that acts as simple canvas on
which one can draw, type and write music by means of OSC
(<a href="http://opensoundcontrol.org/introduction-osc">Open Sound Control</a>) messages and Transience is a <a href="http://www.python.org">Python</a> application that is
designed to render Transience score on INScore's canvas. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> Installing in Mac OS </h3>
<div class="outline-text-3" id="text-2">

<p>You may download Transience from here:
<a href="http://matralab.hexagram.ca/~mseta/transience/">http://matralab.hexagram.ca/~mseta/transience/</a> 
</p>
<p>
Unpack the .zip archive anywhere on your hard-drive and you can run it in the usual wya, by double-clicking the application icon.
</p>
<p>
INScore is actually embedded in the current version of Transience. This may change in the future but for now, simply running Transience will launch INScoreViewer and he user will see and interact with INScoreViewer. Please keep in mind one imporant point:
</p>
<ul>
<li>
Transience must be quit with the "QUIT" button (grey-colored text, actually) located in the upper left corner of the score window. 
<ul>
<li>
This is <b>very</b> important because Transience application is running as a background process (i.e. it is not visible) and it communicates with INScoreViewer via sockets. The socets use specific ports for communication and if INScoreViewer window is closed with the "x" icon on the title bar or via Command-Q, Transience does not know about it and it will continue its opration. This will result in errors when trying to start it again. This behaviour will be fixed in the next few days.
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> Operation </h3>
<div class="outline-text-3" id="text-3">

<p>For those of you have seen the paper version of the score, the screen version will look less familiar. First of all, the "X" and "TEXT?" cards are not present. They are still represented in the score but in different ways, which are explained below. The Japanese and English text have also changed their behaviour. And the layout is different, it has been optimised by Sandeep in order to benefit the fact that some information is not represented any more with "cards" and to improve the reading flow.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4"><span class="section-number-3">4</span> Saving score pages </h3>
<div class="outline-text-3" id="text-4">

<p>The score pages are automatically saved every time the score page is changed. The pages are saved as .png image in a temporary directory (/tmp) with a name such as this: transience-20111107-18.32.17 (transience followed by date and time of creation). On some systems ( such as MacOS X) the /tmp directory may be invisible. If You're on a Mac, one easy way to open it in finder is by typing the following command into the Terminal (the Terminal program can be found in the Applications/Utilities folder or simply by typing "terminator" into the search box in the Finder's menu bar)
</p>


<pre class="src src-bash">open /tmp
</pre>



<p>
One may then use the saved score page sets to replay exactly the same page sequence with an image viewer (as a slideshow) without resorting to use the Transience software. <b>Important</b>: the /tmp directory is erased after a reboot so please copy any interesting configurations into some directory in your user-space. This is a design decision to avoid cluttering up your personal folders with lots of data but the location may change in the future.
</p>

</div>

<div id="outline-container-4_1" class="outline-4">
<h4 id="sec-4_1"><span class="section-number-4">4.1</span> The changes from the original, paper version </h4>
<div class="outline-text-4" id="text-4_1">

<ul>
<li>
the "X" card is replaced by a system of highlights of elements. The order is randomly generated every time the application is run.
</li>
<li>
The "TEXT?" elements, is also replaced by a software random function. The rules are as follows: if you see only English text, use the english language, if you see both English and Japanese versions, use the Japanese (English is there only to help to understand the poem). If you see no poems, do not read any.

</li>
</ul>

<p>Advancing to the following pages is done by clicking on any of the images on the screen (MIDI pedal control wil be implemented in the final version). The first click will simply repeat the first page (this is the <b>real</b> first page) but this time with some of the elements highlighted with a lighter shade of brown. The highlighted elements will be replaced by their next counterparts on the next "page". The score has a total of 9 pages and after the 9th page the score will restart at page 1 with the same page sequence except for the choices of Japanese/English/None texts (I am not sure whether this should be considered a feature or a bug&hellip;)
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-4">
<h4 id="sec-4_2"><span class="section-number-4">4.2</span> Score configuration </h4>
<div class="outline-text-4" id="text-4_2">

<p>Although the "X" and "TEXT?" cards' order is generated randomly, the other cards are under your control. The very first time you run the score, the software will generate a random score for you (which is still a valid Transience score). It will write this configuration into a hidden file in your home directory (the file is named .transiencerc). That file will contain all the information to retrieve exactly the same order of cards every time (but remember that the English/Japanese/None text instructions as well as which elements change from one page to another are generated randomly for you).
</p>
<p>
Should you want to change the score configuration, which used to be done by following the "rombic matrices" document, you can do so now with the configuration screen. Click the "Configure score" text in the upper right corner and you will be presented with a new window. The window allows you to change the oder of cards in each of the "stacks". Figuring out the the path on the rombing matrix is not necessary anymore, all possible paths are already pre-computed. You will see only 5 cards, arranged in one of the possible configurations. By clicking on any of the cards, the sequence of cards will change to the next possible configuration. Click on the "Next element &ndash;&gt;" text to reconfigure other elements until you have configured each stack to your liking.
</p>
<p>
Clicking "SAVE" will save a new .transiencerc which will now be the default everytime you run Transience. The previous version will be backed up (in /var/tmp/transience directory, timestamped with the date and time of the backup).
</p>
<p>
Clicking "CANCEL" will do nothing, it will simply close the configuration window.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5"><span class="section-number-3">5</span> Installing on Linux: </h3>
<div class="outline-text-3" id="text-5">

<p>Although Transience has been developped on Linux, there is no Linux package yet as MacOS packaging was given priority. If you need to use Transience on Linux, please communicate with me (mis@artnegine.ca) and I will send you instructions on how to get going.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6"><span class="section-number-3">6</span> Outro </h3>
<div class="outline-text-3" id="text-6">



</div>

<div id="outline-container-6_1" class="outline-4">
<h4 id="sec-6_1"><span class="section-number-4">6.1</span> To do </h4>
<div class="outline-text-4" id="text-6_1">

<ul>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> MIDI pedal control
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Automatic generation of score session for synchronising with recordings

</li>
</ul>

<p>There are probably some problems with the application, please try it for yourself and get familiar with the score layout and the overall functionnality. Please, do not hesitate to communicate any ideas or notes concerning the layout, design or the functionality of this software.
</p>
<p>
Sandeep Bhagwati - sandeep.bhagwati@gmail.com, Michal Seta - mis@artengine.ca
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Michal
</p>
<p class="date"> Date: 2011-11-07 22:24:42 EST</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
